Repository: matan-h/friendly
Catalog: friendly/locales/*/LC_MESSAGES/friendly.po
Languages: he

source: Perhaps you meant `import {name}.{attr}`. `{attr}` is a name similar to `{rest}` and is a module that can be imported from `{name}`.
he: אולי התכוונת ל'ייבא {name}. {Attr} '. '{attr}' הוא שם הדומה ל- '{rest}' והוא מודול ש ניתן לייבא מ '{name}'.

source: Did you mean `from {name} import {attr}`?
he: האם התכוונת ל-`from {name} import {attr}`? ('מתוך {name} יבוא {attr})' ?

source: Perhaps you meant `from {name} import {attr}`. `{attr}` is a name similar to `{rest}` and is an object that can be imported from `{name}`.
he: אולי התכוונת ל `from {name} import {attr}` (מ- {name} יבא {attr}'. ') `{attr}` הוא שם הדומה ל- `{rest}` והוא אובייקט ש ניתן לייבא מ '{name}'.

source: Other objects with similar names that are part of `{name}` include `{others}`.
he: אובייקטים אחרים עם שמות דומים שהם חלק מ "{name}" כלול "{others}".

source: `{rest}` cannot be imported from `{name}`.
he: לא ניתן לייבא את '{rest}' מתוך '{name}'.

source: The curses module is rarely installed with Python on Windows.
he: המודול "curses" מותקן לעתים רחוקות עם Python ב- Windows.

source: The curses module is often not installed with Python.
he: המודול "curses" לרוב אינו מותקן עם Python.

source: You have tried to import the curses module.
he: ניסית לייבא את המודול "curses ".

source: No module named `{name}` can be imported. Perhaps you need to install it.
he: לא ניתן לייבא מודול בשם '{name}'. אולי אתה צריך להתקין אותו.

source: The following existing modules have names that are similar to the module you tried to import: `{names}`
he: במודולים הקיימים הבאים יש שמות דומים למודול שניסית לייבא: `{names}`

source: `{name}` is an existing module that has a similar name.
he: "{name}" הוא מודול קיים בעל שם דומה.

source: You are already using Python!
he: אתה כבר משתמש בפייתון!

source: In your program, `{var_name}` is an unknown name that exists in an enclosing scope, but has not yet been assigned a value.
he: בתוכנית שלך, '{var_name}' הוא שם לא ידוע שקיים בהיקף סגור, אך עדיין לא הוקצה לו ערך.

source: In your program, no object with the name `{var_name}` exists.
he: בתוכנית שלך אין אובייקט בשם "{var_name}".

source: Did you mean `1j`?
he: האם התכוונת ל '1j'?

source: However, sometimes `{name}` is intended to represent the square root of `-1` which is written as `1j` in Python.
he: עם זאת, לפעמים '{name}' נועד לייצג השורש הריבועי של '-1' שנכתב כ- '1j' בפייתון.

source: Did you use a colon instead of an equal sign?
he: האם השתמשת בנקודותיים במקום בסימן שוויון?

source: I have no additional information for you.
he: אין לי מידע נוסף עבורך.

source: You must be a fan of PyConAu!
he: אתה חייב להיות מעריץ של PyConAu!

source: I am guessing that you tried to use (one of) the flipfloperators shown during the second Lightning Talk session of PyConAu 2018, but that you forgot to import the module from PyPI. #### Note that it is still a bad idea.
he: אני מנחש שניסית להשתמש (באחד) מהflipfloperators שהוצגו במהלך הפגישה השנייה של Lightning Talk של PyConAu 2018, אבל ששכחת לייבא את המודול מ- PyPI. #### שים לב שזה עדיין רעיון גרוע.

source: Did you forget to import `{name}`?
he: שכחת לייבא את '{name}'?

source: The name `{name}` is not defined in your program. Perhaps you forgot to import `{lowercase}` which is found in Python's standard library.
he: השם "{name}" לא מוגדר בתוכנית שלך. אולי שכחת לייבא את '{lowercase}' שנמצא בספרייה הסטנדרטית של פייתון.

source: Note that the name of the module is `{lowercase}` and not `{name}`.
he: שים לב כי שם המודול הוא '{lowercase}' ולא '{name}'.

source: The similar name `{name}` was found in the local scope.
he: השם הדומה '{name}' נמצא בהיקף המקומי.

source: The similar name `{name}` was found in the global scope.
he: השם הדומה '{name}' נמצא בהיקף הגלובלי.

source: The Python builtin `{name}` has a similar name.
he: לשם הסטנדרטי של פייתון `{name}` יש שם דומה.

source: Instead of writing `{name}`, perhaps you meant one of the following:
he: במקום לכתוב '{name}', אולי התכוונת לאחד מהדברים הבאים:

source: * Local scope:
he: * היקף מקומי

source: * Global scope:
he: * היקף גלובלי

source: * Python builtins:
he: * שמות סטנדרטים של פייתון

source: I suspect that you are trying to connect to a server and that a connection cannot be made. If that is the case, check for typos in the URL and check your internet connectivity.
he: אני חושד שאתה מנסה להתחבר לשרת ו שלא ניתן ליצור קשר. אם זה המצב, בדוק אם יש שגיאות כתיב בכתובת האתר ובדוק את חיבור האינטרנט שלך.

source: Did you forget to convert the string `{name}` into {number_type}?
he: שכחת להמיר את המחרוזת "{name}" ל- {number_type}?

source: Perhaps you forgot to convert the string `{name}` into {number_type}.
he: אולי שכחת להמיר את המחרוזת "{name}" ל- {number_type}.

source: You tried to concatenate (add) two different types of objects: {first} and {second}.
he: ניסית לחבר (להוסיף) שני סוגים שונים של אובייקטים: {first} ו- {second}.

source: You tried to add two incompatible types of objects: {first} and {second}.
he: ניסית להוסיף שני סוגים של אובייקטים לא תואמים: {first} ו- {second}.

source: You tried to subtract two incompatible types of objects: {first} and {second}.
he: ניסית להפחית שני סוגים של אובייקטים לא תואמים: {first} ו- {second}.

source: You tried to multiply two incompatible types of objects: {first} and {second}.
he: ניסית להכפיל שני סוגים של אובייקטים לא תואמים: {first} ו- {second}.

source: You tried to divide two incompatible types of objects: {first} and {second}.
he: ניסית לחלק שני סוגים של אובייקטים לא תואמים: {first} ו- {second}.

source: You tried to perform the bitwise operation {operator} on two incompatible types of objects: {first} and {second}.
he: ניסית לבצע את הפעולה הסיבית {operator} על שני סוגי אובייקטים לא תואמים: {first} ו- {second}.

source: Did you mean `{line}`?
he: האם התכוונת ל "{line}"?

source: Outside of Python, `^` is often used to indicate exponentiation.
he: מחוץ לפייתון, '^' משמש לעתים קרובות לציון חזקה.

source: Perhaps you meant `{line}`.
he: אולי התכוונת ל '{line}'.

source: You tried to perform the bit shifting operation {operator} on two incompatible types of objects: {first} and {second}.
he: ניסית לבצע את פעולת העברת הסיביות {operator} על שני סוגי אובייקטים לא תואמים: {first} ו- {second}.

source: You tried to exponentiate (raise to a power) using two incompatible types of objects: {first} and {second}.
he: ניסית להעריך (להעלות בחזקה) שימוש בשני סוגים של אובייקטים לא תואמים: {first} ו- {second}.

source: You tried to use the operator {operator} using two incompatible types of objects: {first} and {second}. This operator is normally used only for multiplication of matrices.
he: ניסית להשתמש באופרטור {operator} שימוש בשני סוגים של אובייקטים לא תואמים: {first} ו- {second}. מפעיל זה משמש בדרך כלל בלבד לריבוי מטריצות.

source: Complex numbers cannot be ordered.
he: לא ניתן לסדר מספרים מורכבים.

source: You tried to do an order comparison ({operator}) between two complex numbers.
he: ניסית לבצע השוואת סדר ({operator}) בין שני מספרים מורכבים.

source: You tried to do an order comparison ({operator}) between two incompatible types of objects: {first} and {second}.
he: ניסית לבצע השוואת סדר ({operator}) בין שני סוגי אובייקטים לא תואמים: {first} ו- {second}.

source: You tried to use the unary operator '{operator}' with the following type of object: {obj}. This operation is not defined for this type of object.
he: ניסית להשתמש באופרטור האנורי '{operator}' עם סוג האובייקט הבא: {obj}. פעולה זו אינה מוגדרת עבור אובייקט מסוג זה.

source: In Python, some objects are known as immutable: once defined, their value cannot be changed. You tried change part of such an immutable object: {obj}, most likely by using an indexing operation.
he: בפייתון כמה אובייקטים ידועים כבלתי משתנים: לאחר שהוגדר, לא ניתן לשנות את ערכם. ניסית לשנות חלק מאובייקט בלתי משתנה כזה: {obj}, סביר להניח על ידי שימוש בפעולת אינדקס.

source: Did you mean to use a list?
he: האם התכוונת להשתמש ברשימה?

source: Perhaps you meant to use a list instead.
he: אולי התכוונת להשתמש ברשימה במקום זאת.

source: In Python 3, exceptions must be derived from BaseException.
he: ב- Python 3 יש לגזור חריגים מ- BaseException.

source: You apparently have called the function `{fn_name}` with {nb_given} positional argument(s) while it requires {nb_required} such positional argument(s).
he: כנראה קראת לפונקציה '{fn_name}' עם {nb_given} ארגומנטים בזמן שהוא דורש {nb_required} ארגומנטים כאלה.

source: Perhaps you forgot `self` when defining `{fn_name}`.
he: אולי שכחת את 'self'(עצמי) בהגדרת '{fn_name}'.

source: You apparently have called the function '{fn_name}' with fewer positional arguments than it requires ({nb_required} missing).
he: כנראה קראת לפונקציה '{fn_name}' עם פחות ארגומנטים מיקוםיים ממה שהוא דורש (חסר {nb_required}).

source: Note: `NoneType` means that the object has a value of `None`.
he: הערה: 'NoneType' פירושו שלאובייקט יש ערך 'None' (כלום).

source: Python indicates that you have an object of type `{obj_type}`, followed by something surrounded by parentheses, `(...)`, which Python took as an indication of a function call. Either the object of type `{obj_type}` was meant to be a function, or you forgot a comma before `(...)`.
he: Python מציין שיש לך אובייקט מסוג '{obj_type}', ואחריו משהו מוקף בסוגריים, `(...)`, אשר לקח פייתון כאינדיקציה לשיחת פונקציה. או שאובייקט מסוג '{obj_type}' נועד להיות פונקציה, או ששכחת פסיק לפני `(...)`.

source: The parenthesis `()` following `{obj_name}` are interpreted by Python as a function call for `{obj_name}`. However, `{obj_name}` is not a function but an object of type `{obj_type}`.
he: הסוגריים `()` לאחר `{obj_name}` מתפרשים על ידי פייתון כקריאת פונקציה עבור '{obj_name}'. עם זאת, '{obj_name}' אינו פונקציה אלא אובייקט מסוג '{obj_type}'.

source: Because of the surrounding parenthesis, `{fn_call}` is interpreted by Python as indicating a function call for `{obj_name}`, which is an object of type `{obj_type}` which cannot be called.
he: בגלל הסוגריים שמסביב, '{fn_call}' מתפרש על ידי פייתון כמעיד על קריאה לפונקציה `{obj_name}`, שהוא אובייקט מסוג '{obj_type}' שלא ניתן לקרוא לה.

source: However, `{fn_call}` is a `tuple`. Either the object `{obj_name}` was meant to be a function or you have a missing comma between the object `{obj_name}` and the tuple `{fn_call}` and meant to write `{obj_name}, {fn_call}`.
he: עם זאת, '{fn_call}' הוא 'צמד' (tuple). או שהאובייקט "{obj_name}" נועד להיות פונקציה או שיש פסיק חסר בין האובייקט '{obj_name}' והצמד '{fn_call}' והתכוון לכתוב `{obj_name}, {fn_call}`.

source: Did you forget a comma between `{obj_name}` and `{fn_call}`?
he: האם שכחת פסיק בין '{obj_name}' לבין '{fn_call}'?

source: However, `{obj_name}` is a sequence. Perhaps you meant to use `[]` instead of `()` and write `{obj_name}[{slice}]`
he: עם זאת, '{obj_name}' הוא רצף. אולי התכוונת להשתמש ב- [] במקום במקום () ולכתוב `{obj_name} [{slice}]`

source: Did you mean `{obj_name}[{slice}]`?
he: האם התכוונת ל '{obj_name} [{slice}]'?

source: However, both `{obj_name}` and `{fn_call}` are numbers. Perhaps you forgot a multiplication operator, `*`, and meant to write `{obj_name} * {fn_call}` .
he: עם זאת, הן "{obj_name}" והן "{fn_call}" הם מספרים. אולי שכחת אופרטור כפל, "*", והתכוונת לכתוב '{obj_name} * {fn_call}' .

source: Did you mean `{obj_name} * {fn_call}`?
he: האם התכוונת ל '{obj_name} * {fn_call}'?

source: Did you forget to convert `{name}` into an integer?
he: שכחת להמיר את '{name}' למספר שלם?

source: Perhaps you forgot to convert `{name}` into an integer.
he: אולי שכחת להמיר את '{name}' למספר שלם.

source: You can only multiply sequences, such as list, tuples, strings, etc., by integers.
he: אתה יכול רק להכפיל רצפים, כגון רשימה, זוגות, מחרוזות וכו ', לפי מספרים שלמים.

source: Did you forget to convert `{name1}` and `{name2}` into integers?
he: שכחת להמיר את '{name1}' ו- '{name2}' למספרים שלמים?

source: Perhaps you forgot to convert `{name1}` and `{name2}` into integers.
he: אולי שכחת להמיר את '{name1}' ו- '{name2}' למספרים שלמים.

source: You wrote an object of type `{obj}` where an integer was expected.
he: כתבת אובייקט מסוג '{obj}' שבו צפוי מספר שלם.

source: Did you forget to convert `{names}` into integers?
he: האם שכחת להמיר את '{names}' למספרים שלמים?

source: In the expression `{line}` what is included between the square brackets, `[...]`, must be either an integer or a slice (`start:stop` or `start:stop:step`) and you have used {obj_type} instead.
he: בביטוי `{line}` מה כלול בין הסוגריים המרובעים, '[...]', חייב להיות מספר שלם או פרוסה (`התחל: עצור` או` התחל: עצור: שלב`) והשתמשת במקום זאת ב- {obj_type}.

source: Note: sometimes this exception is raised because what Python interprets as indices was meant to be a separate list, and a comma should have been written before the opening `[` of that list.
he: הערה: לפעמים חריג זה מועלה כי מה שפייתון פירש כאינדקס נועד להיות רשימה נפרדת, ופסיק היה צריך להיכתב לפני הפתיחה` [`של רשימה זו.

source: Did you forget a comma?
he: שכחת פסיק?

source: Did you forget a comma before `{index}`?
he: שכחת פסיק לפני '{index}'?

source: When using a slice to extract a range of elements from a sequence, that is something like `[start:stop]` or `[start:stop:step]` each of `start`, `stop`, `step` must be either an integer, `None`, or possibly some other object having an `__index__` method.
he: בעת שימוש בפרוס (slice) לחילוץ מגוון אלמנטים מרצף, זה משהו כמו `[start: stop]` או `[start: stop: step]` כל אחד מ'התחלה ',' עצירה ',' שלב 'חייב להיות מספר שלם,' אין ', או אולי אובייקט אחר בעל שיטת '__index__'.

source: Instead of using {original}, consider using {replacement}.
he: במקום להשתמש ב- {original}, שקול להשתמש ב- {replacement}.

source: Subscriptable objects are typically containers from which you can retrieve item using the notation `[...]`.
he: אובייקטים הרשמים הם בדרך כלל מיכלים מהם אתה יכול לאחזר פריט באמצעות הסימון '[...]'.

source: Using this notation, you attempted to retrieve an item from an object of type `{obj_type}` which is not allowed.
he: באמצעות סימון זה ניסית לאחזר פריט מאובייקט מסוג '{obj_type}' שאינו מותר.

source: Perhaps you meant to write `{line}`.
he: אולי התכוונת לכתוב '{שורה}'.

source: Using this notation, you attempted to retrieve an item from `{name}`, an object of type `{obj_type}`. This is not allowed.
he: באמצעות סימון זה ניסית לקבל פריט מתוך '{name}', אובייקט מסוג '{obj_type}'. זה אסור.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables. An iterable is required here.
he: חוזר הוא אובייקט המסוגל להחזיר את פרטיו,אחד בכל פעם. מכולות (`רשימה, tuple, dict`, וכו ') הם רכיבים חוזרים. דרוש כאן חזרה.

source: Unpacking is a convenient way to assign a name, to each item of an iterable.
he: פריקה היא דרך נוחה להקצות שם, לכל פריט של חוזר.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables, but not objects of type `{obj_type}`.
he: חוזר הוא אובייקט המסוגל להחזיר את פרטיו,אחד בכל פעם. מכולות (`רשימה, tuple, dict`, וכו ') הם רכיבים חוזרים. אבל לא אובייקטים מהסוג `{obj_type}`.

source: {function} does not accept a sequence as an argument. Instead of writing `{line}` perhaps you should use the `dict.fromkeys()` method: `{new_line}`.
he: {function} אינו מקבל רצף כארגומנט. במקום לכתוב '{line}' אולי כדאי להשתמש בשיטת 'dict.fromkeys ()': "{new_line}". (מילון.מהמפתחות(...))

source: Did you forget to call `{name}`?
he: שכחת לקרוא ל '{name}'?

source: I suspect that you forgot to add parentheses to call `{name}`. You might have meant to write: `{line}`
he: אני חושד ששכחת להוסיף סוגריים כדי לקרוא '{name}'. אולי התכוונת לכתוב: `{line}`

source: The name `{var_name}` exists in both the global and nonlocal scope. This can be rather confusing and is not recommended. Depending on which variable you wanted to refer to, you needed to add either global {var_name} or nonlocal {var_name} as the first line inside your function.
he: השם "{var_name}" קיים גם בתחום הגלובלי וגם הלא -מקומי. זה יכול להיות די מבלבל ואינו מומלץ. תלוי לאיזה משתנה אתה רוצה להתייחס, היית צריך להוסיף את זה {var_name} גלובלי אוֹ {var_name} לא -מקומי כשורה הראשונה בתוך הפונקציה שלך.

source: Did you forget to add either `global {var_name}` or `nonlocal {var_name}`?
he: שכחת להוסיף את 'global {var_name}' או `לא -מקומי {var_name}`?

source: Did you forget to add `{scope} {var_name}`?
he: שכחת להוסיף את '{scope} {var_name}'?

source: In this instance, there are more names ({nb_names}) than {length}, the length of the iterable.
he: במקרה זה, ישנם שמות נוספים ({nb_names}) יותר מ- {length}, אורך ה- iterable.

source: In this instance, there are more names ({nb_names}) than the length of the iterable, {iter_type} of length {length}.
he: במקרה זה, ישנם שמות נוספים ({nb_names}) מאשר אורך ה- iterable, {iter_type} של אורך {length}.

source: In this instance, there are fewer names ({nb_names}) than the length of the iterable.
he: במקרה זה, יש פחות שמות ({nb_names}) מהאורך של החוזר.

source: In this instance, there are fewer names ({nb_names}) than the length of the iterable, {iter_type} of length {length}.
he: במקרה זה, יש פחות שמות ({nb_names}) מאשר אורך ה- iterable, {iter_type} של אורך {length}.

source: `int()` expects an argument that looks like a number in base `{base}` but you gave it an empty string.
he: int ()` (שלם) מצפה לארגומנט שנראה כמו מספר בבסיס' {base} ' אבל נתת לו מחרוזת ריקה.

source: `{value}` is an invalid argument for `int()` in base `{base}`.
he: `{value}` הוא ארגומנט לא חוקי עבור `int (שלם)` בבסיס `{base}`.

source: In base `{base}`, `int()` is most often use to convert a string containing the digits `0` to `{max_n}` into an integer.
he: בבסיס '{base}', 'int (שלם)' משמש לרוב להמרת מחרוזת המכיל את הספרות '0' עד '{max_n}' למספר שלם.

source: In base `11`, `int()` is most often use to convert a string containing the digits `0` to `9` and the letter `'a'` into an integer.
he: בבסיס '11', 'int (שלם)' משמש לרוב להמרת מחרוזת המכיל את הספרות '0' עד '9' ואת האות 'a' למספר שלם.

source: In base `base`, `int()` is most often use to convert a string containing the digits `0` to `9` and the letters from `'a'` to `'{max_n}'` into an integer.
he: בבסיס 'base', 'int ()' משמש לרוב להמרת מחרוזת המכיל את הספרות '0' עד '9' ואת האותיות מ '' a '' ל '' max_n} 'למספר שלם.

source: When base `0` is specified, `int()` expects the string argument to represent an integer literal.
he: כאשר מצוין בסיס '0', 'int (שלם)' מצפה לארגומנט המחרוזת ל- מייצגים מספר שלם מילולי.

source: You need to convert `'{value}'` to a float first.
he: עליך להמיר תחילה את '' {value} '' לfloat (צף).

source: The string `'{value}'` needs to be first converted using `float()` before the result can be converted into an integer using `int()`.
he: יש להמיר תחילה את המחרוזת '{value}' באמצעות 'float (צף)' לפני שניתן להמיר את התוצאה למספר שלם באמצעות 'int (שלם)'.

source: Did you specify an invalid month?
he: האם ציינת חודש לא חוקי?

source: I am guessing that you specify an invalid value for a month in a `date` object. Valid values are integers, from 1 to 12.
he: אני מנחש שאתה מציין ערך לא חוקי למשך חודש באובייקט `תאריך`. ערכים חוקיים הם מספרים שלמים, מ -1 עד 12.

source: I do not recognize this error message. I am guessing that the problem is with the function `{name}`.
he: אינני מזהה הודעת שגיאה זו. אני מנחש שהבעיה היא בפונקציה '{name}'.

source: Its docstring is: `'''{docstring}'''`
he: ה docstring הוא : `'''{docstring}'''`

source: I have no more information.
he: אין לי מידע נוסף.

source: Using the modulo operator, you are dividing by zero.
he: באמצעות אופרטור המודולו את\ה מחלק באפס.

source: You are dividing by zero.
he: את\ה מחלק\ת באפס.

source: You are dividing by the following term {expression} which is equal to zero.
he: את\ה מחלק\תבמונח הבא {ביטוי} שהוא שווה לאפס.

source: The following mathematical expression includes a division by zero: {expression}
he: הביטוי המתמטי הבא כולל חלוקה באפס: {ביטוי}

source: Using the modulo operator, you are dividing by the following term {expression} which is equal to zero.
he: באמצעות אופרטור המודולו, את\ה מחלק\ת במונח הבא {ביטוי} שהוא שווה לאפס.

source: The second argument of the `divmod()` function is zero.
he: הטיעון השני של הפונקציה `divmod(חלוקה)` הוא אפס.

source: You are attempting to raise the number 0 to a negative power which is equivalent to dividing by zero.
he: את\ה מנסה להעלות את המספר 0 בחזקת מספר שלילי זה מקביל לחלוקה באפס.

source: The following mathematical expression includes a division by zero done using the modulo operator: {expression}
he: הביטוי המתמטי הבא כולל חלוקה באפס נעשה באמצעות אופרטור מודולו: {ביטוי}

source: The second argument of the `divmod()` function is equal to zero.
he: הטיעון השני של הפונקציה `divmod(חלוקה)` שווה אפס.

source: Currently, I cannot guess the likely cause of this error. Try to examine closely the line indicated as well as the line immediately above to see if you can identify some misspelled word, or missing symbols, like (, ), [, ], :, etc. Unless your code uses type annotations, which are beyond our scope, if you think that this is something which should be handled by friendly, please report this case to https://github.com/aroberge/friendly/issues
he: נכון לעכשיו, אינני יכול לנחש את הסיבה הסבירה לשגיאה זו. נסה\י לבחון מקרוב את הקו המצוין כמו גם את הקו מיד למעלה כדי לראות אם אפשר לזהות כמה שגיאות כתיב מילה או סמלים חסרים, כמו (,), [,],:, וכו '. אלא אם כן הקוד שלך משתמש ברמזי סוג, שהם מעבר להיקף שלנו, אם את\ה חושב\ת שזה משהו שצריך לטפל בו על ידי ידידותי, אנא דווח על מקרה זה https://github.com/aroberge/friendly/issues

source: Python told us that it expected a colon at the position indicated. However, adding a colon or replacing something else by a colon would not fix the problem.
he: פייתון אמר לנו שהוא מצפה לנקודותיים במיקום המצוין. עם זאת, הוספת נקודתיים או החלפת משהו אחר בנקודותיים לא יתקן את הבעיה.

source: Python gave us the following informative message about the possible cause of the error: {message} However, I do not recognize this information and I have to guess what caused the problem, but I might be wrong.
he: פייתון מסר לנו את ההודעה האינפורמטיבית הבאה לגבי הסיבה האפשרית לשגיאה: {הוֹדָעָה} עם זאת, אינני מזהה מידע זה ויש לי לנחש מה גרם לבעיה, אבל יכול להיות שאני טועה.

source: However, making such a change would still not correct all the syntax errors in the code you wrote.
he: עם זאת, שינוי כזה עדיין לא היה נכון כל שגיאות התחביר בקוד שכתבת.

source: The correct syntax is: {async_}def name ( ... ):
he: התחביר הנכון הוא: {async_}def name ( ... ):

source: A function needs a name.
he: פונקציה צריכה שם.

source: You tried to define a function and did not use the correct syntax.
he: ניסית להגדיר פונקציה ולא השתמשת בתחביר הנכון.

source: Functions and methods need a name.
he: פונקציות ושיטות צריכות שם.

source: You tried to define a function or method and did not use the correct syntax.
he: ניסית להגדיר פונקציה או שיטה ולא השתמשת בתחביר הנכון.

source: Did you forget parentheses?
he: שכחת סוגריים?

source: Perhaps you forgot to include parentheses. You might have meant to write {line}
he: אולי שכחת לכלול סוגריים. אולי התכוונת לכתוב {line}

source: A function definition statement must end with a colon.
he: הצהרת הגדרת פונקציה חייב להסתיים בנקודותיים.

source: Did you forget to write a colon?
he: שכחת לכתוב נקודתיים?

source: You wrote `{bad}` instead of a colon.
he: כתבת '{bad}' במקום נקודתיים.

source: Did you write something by mistake after the colon?
he: כתבת משהו בטעות אחרי הנקודותיים?

source: A block of code must come after the colon.
he: בלוק קוד חייב לבוא אחרי הנקודותיים.

source: Removing `{bad}`, might fix the problem.
he: הסרת '{bad}' עשויה לפתור את הבעיה.

source: You cannot use a Python keyword as a function name.
he: אינך יכול\ה להשתמש במילת מפתח של פייתון כשם פונקציה.

source: You tried to use the Python keyword `{kwd}` as a function name.
he: ניסית להשתמש במילת המפתח של פייתון '{kwd}' כשם פונקציה.
