Repository: matan-h/friendly
Catalog: friendly/locales/*/LC_MESSAGES/friendly.po
Languages: he

source: Type 'Friendly' for help on special functions/methods.
he: הקלד 'Friendly' בשביל עזרה עם פונקציות מיוחדות.

source: Warning: you added a type hint to the python builtin `{name}`.
he: אזהרה: הוספת רמז סוג לאובייקט סטנדרטי של פיתון : '{name}'.

source: Warning: you used a type hint for a variable without assigning it a value.
he: אזהרה: השתמשת ברמז סוג עבור משתנה מבלי להקצות לו ערך.

source: Instead of `{hint}`, perhaps you meant `{assignment}`.
he: במקום "{hint}", אולי התכוונת ל"{assignment}".

source: Warning: you have redefined the python builtin `{name}`.
he: אזהרה: הוספת רמז סוג לאובייקט סטנדרטי של פייתון : '{name}'.

source: Nothing to go back to: no exception recorded.
he: אין מה לחזור אליו: לא נרשם חריג.

source: Invalid argument for `www()`. Valid arguments include `None` or one of `{sites}`.
he: ארגומנט לא חוקי עבור 'www()'. ארגומנטים חוקיים כוללים את 'ללא' או אחד מתוך '{sites}'.

source: The default web browser cannot be used for searching.
he: אין אפשרות להשתמש בדפדפן האינטרנט המוגדר כברירת מחדל לחיפוש.

source: Removes the last recorded traceback item.
he: מסיר את ה- traceback האחרון שנרשם.

source: Shows all the information about the last traceback.
he: מציג את כל המידע אודות החריג האחרון.

source: Shows a list of recorded traceback messages.
he: מציג רשימה של החריגים האחרונים.

source: Sets the language to be used.
he: הגדרת השפה לשימוש.

source: Shows the paths corresponding to synonyms used.
he: מציג את הנתיבים המתאימים למילים נרדפות בשימוש.

source: Shows the generic meaning of a given exception
he: מראה את המשמעות הגנרית של חריג נתון

source: Shows where an exception was raised.
he: מראה היכן הועלה חריג.

source: Shows the likely cause of the exception.
he: מציג את הסיבה הסבירה לחריג.

source: Opens a web browser at a useful location.
he: פותח דפדפן אינטרנט במיקום שימושי.

source: Suggestion sometimes added to a friendly traceback.
he: ההצעה לפעמים נוספת ל- Friendly.

source: Shows a normal Python traceback.
he: מראה את הtraceback הרגיל של פייתון.

source: Shows a simplified Python traceback.
he: מראה traceback פשוט יותר של פייתון.

source: Returns the current value used for items to include by default.
he: מחזיר את הערך הנוכחי של פריטים שיכללו.

source: Sets the items to show by default when an exception is raised.
he: מגדיר את הפריטים שיוצגו כברירת מחדל כאשר יוצג חריג.

source: Returns the language currently used.
he: מחזיר את השפה הנוכחית.

source: Sets the formatter to use for display.
he: מגדיר את התבנית לתצוגה.

source: The following methods of the Friendly object might also be available as functions.
he: השיטות הבאות של האובייקט Friendly עשויות להיות זמינות גם כפונקציות.

source: Basic methods:
he: שיטות בסיסיות:

source: Less commonly used methods/functions.
he: פונקציות פחות נפוצות.

source: Sets a colour scheme designed for a black background.
he: קובע ערכת צבעים המיועדת לרקע שחור.

source: Sets a colour scheme designed for a white background.
he: קובע ערכת צבעים המיועדת לרקע לבן.

source: More lines not shown.
he: שורות נוספות לא מוצגות.

source: Python exception:
he: החריג המקורי של פייתון:

source: Warning: improperly formed exception. I suspect that a custom exception has been raised with a non-string value used as a message. This can occur if a `__repr__` or a `__str__` method raises an exception or does not return a string.
he: אזהרה: חריג שלא נוצר כהלכה. אני חושד שהועלה חריג מותאם אישית עם ערך שאינו מחרוזת המשמש כהודעה. זה יכול להתרחש אם שיטת '__repr__' או '__str__' מעלה חריג או לא מחזיר מחרוזת.

source: The encoding of the file was not valid.
he: קידוד הקובץ לא היה חוקי.

source: {filename} is not a regular Python file whose contents can be analyzed.
he: {filename} אינו קובץ Python רגיל שניתן לנתח את תוכנו.

source: Exception raised on line {linenumber} of file {filename}.
he: חריג הועלה בשורה {linenumber} של הקובץ {filename}.

source: Execution stopped on line {linenumber} of file {filename}.
he: הביצוע הופסק בשורה {linenumber} של הקובץ {filename}.

source: `{filename}` is not a regular Python file whose contents can be analyzed.
he: `{filename}` אינו קובץ Python רגיל שניתן לנתח את תוכנו.

source: Python could not understand the code in the file '{filename}' beyond the location indicated by ^.
he: פייתון לא הצליח להבין את הקוד בקובץ '{filename}' מעבר למיקום שצוין על ידי ^.

source: Python could not understand the code in the file '{filename}'.
he: פייתון לא הצליח להבין את הקוד בקובץ '{filename}'.

source: Problem: source of `{filename}` is not available
he: בעיה: המקור של '{filename}' אינו זמין

source: Unfortunately, no additional information is available: the content of file '<stdin>' is not accessible. Are you using a regular Python console instead of a Friendly-console?
he: למרבה הצער, אין מידע נוסף זמין: התוכן של הקובץ '<stdin>' אינו נגיש. האם אתה משתמש במסוף פייתון רגיל במקום בקונסולה ידידותית? אולי נסה: `start_console (local_vars = locals ())`.

source: I do not know.
he: אני לא יודע.

source: I have no suggestion to offer; try `why()`.
he: אין לי הצעה להציע; נסה את 'למה()'.

source: I have no suggestion to offer.
he: אין לי הצעה להציע.

source: `ArithmeticError` is the base class for those built-in exceptions that are raised for various arithmetic errors. It is unusual that you are seeing this exception; normally, a more specific exception should have been raised.
he: "ArithmeticError" הוא מחלקת הבסיס לאותם חריגים מובנים שמועלות על טעויות חשבוניות שונות. זה יוצא דופן שאתה רואה את החריג הזה; בדרך כלל, היה צריך להעלות חריג ספציפי יותר.

source: A `FileNotFoundError` exception indicates that you are trying to open a file that cannot be found by Python. This could be because you misspelled the name of the file.
he: חריג של 'FileNotFoundError' מציין שמנסים לפתוח קובץ שפייתון לא מצא. זה יכול להיות בגלל שגיאת כתיב בשם הקובץ.

source: An `ImportError` exception indicates that a certain object could not be imported from a module or package. Most often, this is because the name of the object is not spelled correctly.
he: חריג של 'ImportError' מציין כי אובייקט מסוים לא יכול היה להיות מיובא ממודול או מחבילה. לרוב, זה קורה כי שם האובייקט לא מאוית נכון.

source: An `IndentationError` occurs when a given line of code is not indented (aligned vertically with other lines) as expected.
he: 'IndentationError' מתרחשת כאשר שורת קוד היא לא מיושר אנכית עם קווים אחרים כצפוי.

source: An `IndexError` occurs when you try to get an item from a list, a tuple, or a similar object (sequence), and use an index which does not exist; typically, this happens because the index you give is greater than the length of the sequence.
he: 'IndexError' מתרחש כשאתה מנסה להשיג פריט מרשימה, צמד או אובייקט דומה (רצף), ומשתמש באינדקס אשר לא קיים; בדרך כלל, זה קורה מכיוון שהאינדקס שאתה נותן גדול מאורך הרצף.

source: A `KeyError` is raised when a value is not found as a key in a Python dict or in a similar object.
he: 'KeyError' נזרק כאשר ערך אינו נמצא כ- מפתח במילון או באובייקט דומה.

source: `LookupError` is the base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid. It can also be raised directly by codecs.lookup().
he: 'LookupError' היא מחלקת הבסיס לחריגים שמועלים כאשר המפתח או אינדקס שמשתמשים בהם על מפה או רצף (רשימה,צמד וכדומה) אינם תקפים. ניתן גם להעלות אותו ישירות על ידי codecs.lookup ().

source: Like the name indicates, a `MemoryError` occurs when Python runs out of memory. This can happen if you create an object that is too big, like a list with too many items.
he: כפי שהשם מציין, 'MemoryError' מתרחש כאשר לפייתון נגמר הזיכרון. זה יכול לקרות אם יוצרים אובייקט גדול מדי, כמו רשימה עם יותר מדי פריטים.

source: A `ModuleNotFoundError` exception indicates that you are trying to import a module that cannot be found by Python. This could be because you misspelled the name of the module or because it is not installed on your computer.
he: חריג `ModuleNotFoundError` נזרק כאשר מנסים לייבא מודול שפייתון לא מצא . זה יכול להיות בגלל שגיאת כתיב בשם המודול או מכיוון שהוא לא מותקן במחשב שלך.

source: A `NameError` exception indicates that a variable or function name is not known to Python. Most often, this is because there is a spelling mistake. However, sometimes it is because the name is used before being defined or given a value.
he: חריג של 'NamError' מציין כי משתנה או הפונקציה אינו ידוע לפייתון. לרוב, הסיבה לכך היא שיש טעות כתיב. עם זאת, לפעמים זה בגלל שהשם משמש לפני שמגדירים אותו או נותנים לו ערך.

source: An `OSError` exception is usually raised by the Operating System to indicate that an operation is not allowed or that a resource is not available.
he: בדרך כלל מערכת ההפעלה מעלה חריג של 'OSError' כדי לציין שפעולה אסורה או כי משאב אינו זמין.

source: An exception of type `{name}` is a subclass of `OSError`.
he: חריג מסוג '{name}' הוא תת -סוג של 'OSError'.

source: An `OverflowError` is raised when the result of an arithmetic operation is too large to be handled by the computer's processor.
he: 'OverflowError' מוגבה כאשר התוצאה של פעולה חשבונית הוא גדול מכדי שניתן יהיה לטפל בו במעבד המחשב.

source: A `RecursionError` is raised when a function calls itself, directly or indirectly, too many times. It almost always indicates that you made an error in your code and that your program would never stop.
he: "RecursionError" מועלה כאשר פונקציה קוראת לעצמה, במישרין או בעקיפין, פעמים רבות מדי. זה כמעט תמיד מציין שעשית שגיאה בקוד שלך ושהתוכנית שלך לעולם לא תפסיק.

source: `StopIteration` is raised to indicate that an iterator has no more item to provide when its `__next__` method is called by the `next()` builtin function.
he: 'StopIteration' נזרק כדי להצביע על כך iterator אין יותר פריט לספק כאשר שיטת `__next__` נקראת על ידי הפונקציה סטנדרטית 'next()' .

source: A `SyntaxError` occurs when Python cannot understand your code.
he: 'SyntaxError' נזרק כאשר פייתון אינו מצליח להבין את הקוד שלך.

source: A `ValueError` indicates that a function or an operation received an argument of the right type, but an inappropriate value.
he: 'ValueError' מציין כי פונקציה או פעולה קיבל ערך מהסוג הנכון, אך בעל ערך לא נכון.

source: No information is available about this warning.
he: אין מידע זמין לגבי אזהרה זו.

source: A `ZeroDivisionError` occurs when you are attempting to divide a value by zero either directly or by using some other mathematical operation.
he: 'ZeroDivisionError' מתרחש כאשר אתה מנסה לחלק ערך באפס ישירות או באמצעות פעולה מתמטית אחרת.

source: In your program, the name of the file that cannot be found is `{filename}`.
he: בתוכנית שלך, שם ה- הקובץ שלא ניתן למצוא הוא '{filename}'.

source: a complex number
he: מספר מורכב

source: a dictionary (`dict`)
he: מילון (`dict`)

source: a number (`float`)
he: מספר ('float')

source: an integer (`int`)
he: מספר שלם (`int`)

source: a `list`
he: רשימה (`list`)

source: a `set`
he: `סט` (set)

source: a string (`str`)
he: מחרוזת (`str`)

source: a `tuple`
he: צמד ('tuple')

source: A type hint found for `{name}` in the {scope} scope. Perhaps you had used a colon instead of an equal sign and wrote {name} : {hint} instead of {name} = {hint}
he: רמז סוג נמצא עבור '{name}' בהיקף {scope}. אולי השתמשת בנקודותיים במקום בסימן שווה וכתבת {name}: {hint} במקום {name} = {hint}

source: Please report this example to https://github.com/aroberge/friendly/issues. If you are using a REPL, use `www('bug')` to do so.
he: אנא דווח על דוגמה זו ל- https://github.com/aroberge/friendly/issues. אם אתה משתמש ב- REPL, השתמש ב 'www (' bug ')' לשם כך.

source: No information is known about this exception.
he: אין מידע על חריג זה.

source: If you are using the Friendly console, use `www()` to do an Internet search for this particular case.
he: אם אתה משתמש במסוף ידידותי, השתמש ב- 'www ()' כדי חפש באינטרנט את המקרה הספציפי הזה.

source: You are attempting to access the attribute `{attr}` for a variable whose value is `None`.
he: אתה מנסה לגשת למאפיין '{attr}' עבור משתנה שערכו 'כלום'(none).

source: Did you give your program the same name as a Python module?
he: האם נתת לתוכנית שלך את אותו שם כמו מודול פייתון?

source: I suspect that you used the name `{module}.py` for your program and that you also wanted to import a module with the same name from Python's standard library. If so, you should use a different name for your program.
he: אני חושד שהשתמשת בשם '{module} .py' עבור התוכנית שלך ושאתה גם רוצה לייבא מודול עם אותו שם מהספרייה הסטנדרטית של פייתון. אם כן, עליך להשתמש בשם אחר לתוכנית שלך.

source: You have a circular import.
he: יש לך יבוא מעגלי.

source: You likely have a circular import.
he: סביר להניח שיש לך יבוא מעגלי.

source: Python indicated that the module `{module}` was not fully imported.
he: פייתון ציין כי המודול "{module}` לא יובא במלואו.

source: This can occur if, during the execution of the code in module `{module}` an attempt is made to import the same module again.
he: זה יכול לקרות אם במהלך ביצוע הקוד במודול '{module}' נעשה ניסיון לייבא את אותו מודול שוב.

source: This should not happen: Python tells us that module `{module}` does not have an attribute named `{attribute}`. However, it does not appear that module `{module}` was imported.
he: זה לא אמור לקרות: Python אומר לנו שלמודול '{module}' אין תכונה בשם '{attribute}'. עם זאת, לא נראה כי המודול "{module}" יובא.

source: Did you mean `{name}`?
he: האם התכוונת ל '{name}'?

source: Perhaps you meant to write `{module}.{correct}` instead of `{module}.{typo}`
he: אולי התכוונת לכתוב '{module}. {Correct}' במקום '{module}. {Typo}'

source: Perhaps you meant to use the attribute `{attribute}` of module `{mod_name}` instead of module `{module}`.
he: אולי התכוונת להשתמש במאפיין '{attribute}' של מודול '{mod_name}' במקום מודול '{module}'.

source: Did you mean one of the following modules: `{names}`?
he: האם התכוונת לאחד המודולים הבאים: `{names}`?

source: Instead of the module `{module}`, perhaps you wanted to use the attribute `{attribute}` of one of the following modules: `{names}`.
he: במקום המודול `{module}`, אולי רצית להשתמש התכונה '{attribute}' של אחד מהמודולים הבאים: `{names}`.

source: Python tells us that no object with name `{attribute}` is found in module `{module}`.
he: פייתון אומר לנו שאין אובייקט בשם "{attribute}" שנמצא במודול `{module}`.

source: `{obj_name}` is a function. Perhaps you meant to write `{obj_name}({attribute})`
he: `{obj_name}` היא פונקציה. אולי התכוונת לכתוב `{obj_name} ({attribute})`

source: Did you mean `{obj_name}({attribute})`?
he: האם התכוונת ל "{obj_name} ({attribute})"?

source: `{obj_name}` is a Python built-in function or method which does not have an attribute named `{attribute}.`
he: `{obj_name}` היא פונקציה או שיטה סטנדרטית של פייתון שאין לו תכונה בשם '{attribute}.'

source: An object of type `{obj_type}` has no attribute named `{attr}`. Unfortunately I cannot find such an object on the line where the problem occurs.
he: לאובייקט מסוג '{obj_type}' אין תכונה בשם '{attr}'. לצערי אני לא יכול למצוא אובייקט כזה על הקו שבו הבעיה מתרחשת.

source: An object of type `{obj_type}` has no attribute named `{attr}`. I cannot give additional information: I found one object of this type in the current scope but it does not appear to be the object causing the problem.
he: לאובייקט מסוג '{obj_type}' אין תכונה בשם '{attr}'. אני לא יכול למסור מידע נוסף: מצאתי אובייקט אחד מסוג זה בהיקף הנוכחי אך לא נראה שזה האובייקט שגורם לבעיה.

source: The object `{obj}` has no attribute named `{attr}`.
he: לאובייקט '{obj}' אין תכונה בשם '{attr}'.

source: Note that object `{obj}` uses `__slots__` which prevents the creation of new attributes.
he: שים לב שהאובייקט `{obj}` משתמש ב- `__slots__` אשר מונע יצירת תכונות חדשות.

source: The following are some of its known attributes: `{names}`.
he: להלן כמה מהתכונות הידועות: `{שמות}`.

source: The object `{obj_name}` has no attribute named `{attribute}`.
he: לאובייקט '{obj_name}' אין תכונה בשם '{attribute}'.

source: Perhaps you meant to write `{obj}.{correct}` instead of `{obj}.{typo}`
he: אולי התכוונת לכתוב '{obj}. {Correct}' במקום '{obj}. {Typo}'

source: Did you mean one of the following: `{names}`?
he: האם התכוונת לאחד מהבאים: `{names}`?

source: Instead of writing `{obj}.{typo}`, perhaps you meant to write one of the following names which are attributes of object `{obj}`: `{names}`
he: במקום לכתוב '{obj}. {Typo}', אולי התכוונת לכתוב אחד מהם השמות הבאים שהם תכונות של אובייקט `{obj}`: `{שמות}`

source: Did you write a comma by mistake?
he: כתבת פסיק בטעות?

source: `{obj_name}` is a tuple that contains a single item which does have `'{attribute}'` as an attribute. Perhaps you added a trailing comma by mistake at the end of the line where you defined `{obj_name}`.
he: `{obj_name}` הוא צמד (tuple ) המכיל פריט בודד אשר אכן מכיל "'{attribute}' 'כתכונה. אולי הוספת פסיק נגרר בטעות בסוף השורה שם הגדרת את "{obj_name}".

source: Did you mean `{str_content}.join({obj_name})`?
he: האם התכוונת ל '{str_content}.join({obj_name}) `?

source: The object `{obj_name}` has no attribute named `join`. Perhaps you wanted something like `{str_content}.join({obj_name})`.
he: לאובייקט '{obj_name}' אין תכונה בשם 'join'. אולי רצית משהו כמו '{str_content}.join({obj_name})'.

source: Did you mean `{known_builtin}({obj_name})`?
he: האם התכוונת ל '{known_builtin}({obj_name})'?

source: The object `{obj_name}` has no attribute named `{attribute}`. Perhaps you can use the Python builtin function `{known_builtin}` instead: `{known_builtin}({obj_name})`.
he: לאובייקט '{obj_name}' אין תכונה בשם '{attribute}'. אולי תוכל להשתמש בפונקציה הסטנדרטית של Python `{known_builtin}` במקום: `{known_builtin}({obj_name})`.

source: Did you mean `{attr}`?
he: האם התכוונת ל '{attr}'?

source: The object `{name}` has no attribute named `{attribute}`.
he: לאובייקט '{name}' אין תכונה בשם '{attribute}'.

source: However, `{attr}` is an attribute of `{name}` with a similar meaning.
he: עם זאת, '{attr}' היא תכונה של '{name}' בעלת משמעות דומה.

source: However, `{name}` has the following attributes with similar meanings: `{attributes}`.
he: עם זאת, ל- '{name}' יש את התכונות הבאות בעלות משמעויות דומות: `{attributes}`.

source: Did you mean to separate object names by a comma?
he: האם התכוונת להפריד שמות אובייקטים בפסיק?

source: `{second}` is not an attribute of `{first}`. However, both `{first}` and `{second}` are known objects. Perhaps you wrote a period to separate these two objects, instead of using a comma.
he: '{second}' אינה תכונה של '{first}'. עם זאת, הן "{first}" ו- "{second}" הם אובייקטים ידועים. אולי כתבת תקופה להפריד בין שני האובייקטים האלה, במקום להשתמש בפסיק.

source: The object that could not be imported is `{name}`. The module or package where it was expected to be found is `{module}`.
he: האובייקט שלא ניתן היה לייבא הוא '{name}'. היכן שהמודול או החבילה היו צפויים להימצא הוא '{module}'.

source: Python indicated that you have a circular import. This can occur if executing the code in module 'A' results in executing the code in module 'B' where an attempt to import a name from module 'A' is made before the execution of the code in module 'A' had been completed.
he: Python ציין שיש לך יבוא מעגלי. זה יכול להתרחש אם מבצעים את הקוד במודול 'A' גורם לביצוע הקוד במודול 'B' שבו נעשה ניסיון לייבא שם ממודול 'A' לפני השלמת ביצוע הקוד במודול 'A'.

source: Inconsistent state: `'{module}'` was apparently not imported. As a result, no further analysis can be done.
he: מצב לא עקבי: "'{module}' 'כנראה לא יובא. כתוצאה מכך, לא ניתן לבצע ניתוח נוסף.

source: Perhaps you meant to import `{correct}` (from `{module}`) instead of `{typo}`
he: אולי התכוונת לייבא '{correct}' (מתוך '{module}') במקום '{typo}'

source: Instead of trying to import `{typo}` from `{module}`, perhaps you meant to import one of the following names which are found in module `{module}`: `{candidates}`
he: במקום לנסות לייבא את '{typo}' מתוך '{module}', אולי התכוונת לייבא אחד מ השמות הבאים המופיעים במודול `{module}`: `{candidates}`

source: The object that could not be imported is `{name}`.
he: האובייקט שלא ניתן היה לייבא הוא '{name}'.

source: You have tried to get an item from `{name}`, {obj_type} of length `{length}`, by using a value for the index that I cannot determine but which is not allowed.
he: ניסית להשיג פריט מ- {name} `, {obj_type} של אורך `{length}`, על ידי שימוש באינדקס שאני לא יכול לקבוע אבל אסור.

source: You have tried to get the item with index `{index}` of `{name}`, {obj_type} of length `{length}`.
he: ניסית לקבל את הפריט עם האינדקס '{index}' של '{name}', {obj_type} של אורך `{length}`.

source: The valid index values of `{name}` are integers ranging from `{min}` to `{max}`.
he: ערכי האינדקס התקפים של '{name}' הם מספרים שלמים הנעים בין `{min}` עד `{max}`.

source: Remember: the first item of {obj_type} is not at index 1 but at index 0.
he: זכור: הפריט הראשון של {obj_type} אינו באינדקס 1 אלא באינדקס 0.

source: `{name}` contains no item.
he: `{name}` אינו מכיל פריט.

source: You have tried to get the item with index `{index}` of `{name}`, {obj_type} which contains no item.
he: ניסית לקבל את הפריט עם האינדקס '{index}' של '{name}', {obj_type} שאינו מכיל פריט.

source: You tried to retrieve an item from an empty `dict` or a similar object which I cannot identify.
he: ניסית לקבל פריט מתוך מילון ( 'dict') ריק או אובייקט דומה שאני לא יכול לזהות.

source: `{name}` is an empty `dict`.
he: '{name}' הוא מילון ('dict') ריק.

source: You tried to retrieve an item from `{name}` which is an empty `dict`.
he: ניסית לקבל פריט מתוך '{name}' שהוא מילון ('dict') ריק.

source: You tried to retrieve an item from an empty ChainMap or similar object which I cannot identify.
he: ניסית לאחזר פריט מתוך ChainMap ריק או אובייקט דומה שאני לא יכול לזהות.

source: `{name}` is an empty `ChainMap`.
he: `{name}` הוא `ChainMap` ריק.

source: You tried to retrieve an item from `{name}` which is an empty `ChainMap`.
he: ניסית לקבל פריט מתוך '{name}' שהוא 'ChainMap' ריק.

source: Missing key `{key}` in a `ChainMap` or in a similar object.
he: חסר מפתח '{key}' ב- 'ChainMap' או באובייקט דומה.

source: A `dict` or a similar object which I cannot identify does not have `{key}` as a key.
he: מילון (dict) או אובייקט דומה שאני לא יכול לזהות אין לו '{key}' כמפתח.

source: The key `{key}` cannot be found in the dict `{name}`.
he: לא ניתן למצוא את המפתח `{key}` במילון (dict) בשם `{name}`.

source: The key `{key}` cannot be found in `{name}`, an object of type `{obj_type}`.
he: לא ניתן למצוא את המפתח '{key}' ב- '{name}', אובייקט מסוג '{obj_type}'.

source: `{name}` contains a string key which is identical to `str({key})`. Perhaps you forgot to convert the key into a string.
he: `{name}` מכיל מפתח מחרוזת שזהה ל- `str({key})`. אולי שכחת להמיר את המפתח למחרוזת.

source: Did you forget to convert `{key}` into a string?
he: שכחת להמיר את '{key}' למחרוזת?

source: `{key}` is a string. There is a key of `{name}` whose string representation is identical to `{key}`.
he: `{key}` היא מחרוזת. יש מפתח של '{name}' שייצוג המחרוזות שלו זהה ל- '{key}'.

source: Did you convert `{key}` into a string by mistake?
he: האם המרת את '{key}' למחרוזת בטעות?

source: `{name}` is a key of `{dict_}` which is similar to `{key}`.
he: '{name}' הוא מפתח של '{dict_}' הדומה ל- '{key}'.

source: `{name}` has some keys similar to `{key}` including: `{names}`.
he: '{name}' מכיל כמה מפתחות הדומים ל- '{key}' כולל: `{שמות}`.

source: No additional information available since `{name}` cannot be imported.
he: אין מידע נוסף זמין מכיוון שלא ניתן לייבא את '{name}'.

source: Did you mean `from {name} import {rest}`?
he: האם התכוונת ל-`from {name} import {rest}`? ('מתוך {name} יבא {rest})' ?

source: `{rest}` is not a separate module but an object that is part of `{name}`.
he: '{rest}' אינו מודול נפרד אלא אובייקט שהוא חלק מ- '{name}'.

source: Did you mean `import {name}.{attr}`?
he: האם התכוונת ל-`import {name}.{attr}`? ('יבא {name}.{attr})' ?
