Repository: matan-h/friendly
Catalog: friendly/locales/*/LC_MESSAGES/friendly.po
Languages: he

source: There are more syntax errors later in your code.
he: בהמשך הקוד שלך יש שגיאות תחביר נוספות.

source: You wrote an invalid function name.
he: כתבת שם פונקציה לא חוקית.

source: The name of a function must be a valid Python identifier, that is a name that begins with a letter or an underscore character, `_`, and which contains only letters, digits or the underscore character.
he: שם הפונקציה חייב להיות מזהה פייתון חוקי, זהו שם שמתחיל באות או בתו קו, "_", ואשר מכיל רק אותיות, ספרות וקו תחתון "_" .

source: You attempted to use a string as a function name.
he: ניסית להשתמש במחרוזת בשם פונקציה.

source: You forgot to name your function.
he: שכחת לציין את שם הפונקציה שלך.

source: However, there are some other syntax errors in your code.
he: עם זאת, יש כמה שגיאות תחביר אחרות בקוד שלך.

source: I am guessing that you tried to use the Python keyword `{kwd}` as an argument in the definition of a function where an identifier (variable name) was expected.
he: אני מנחש שניסית להשתמש במילת המפתח של פייתון `{kwd}` כארגומנט בהגדרת פונקציה היכן היה צפוי מזהה (שם משתנה).

source: You cannot use dotted names as function arguments.
he: אינך יכול להשתמש בשמות מנוקדים כארגומנטים של פונקציות.

source: Perhaps you meant to write a comma.
he: אולי התכוונת לכתוב פסיק.

source: Did you mean to write a comma?
he: האם התכוונת לכתוב פסיק?

source: You cannot use dots in function names.
he: לא ניתן להשתמש בנקודות בשמות פונקציות.

source: `/` indicates that the previous arguments in a function definition are positional arguments.
he: `/` מציין כי הטיעונים הקודמים בהגדרת פונקציה הם טיעונים עמדתיים.

source: Function definitions cannot include the symbol `/` in this Python version.
he: הגדרות פונקציות אינן יכולות לכלול את הסמל '/' בגרסת פייתון זו.

source: This symbol can only be used with Python versions 3.8.0 or newer. You are using Python version {version}.
he: ניתן להשתמש בסמל זה רק עם גרסאות פיתון 3.8.0 ואילך. אתה משתמש בגרסת פייתון {version}.

source: You have unspecified keyword arguments that appear before the symbol `/`.
he: יש לך ארגומנטים לא מפורטים של מילות מפתח המופיעים לפני הסמל `/`.

source: Keyword arguments must appear after the `/` symbol.
he: ארגומנטים של מילות מפתח חייבים להופיע אחרי הסמל `/`.

source: However, `*` indicates that the arguments that follow must be keyword arguments. When they are used together, `/` must appear before `*`.
he: עם זאת, '*' מציין כי הטיעונים הבאים חייבים להיות טיעוני מילות מפתח. כאשר הם משמשים יחד, '/' חייב להופיע לפני '*'.

source: `*` must appear after `/` in a function definition.
he: '*' חייב להופיע אחרי '/' בהגדרת פונקציה.

source: `*{name}` must appear after `/` in a function definition.
he: '*{name}' חייב להופיע אחרי '/' בהגדרת פונקציה.

source: You can only use `/` once in a function definition.
he: אפשר להשתמש ב- / רק פעם אחת בהגדרת פונקציה.

source: You can only use `*` once in a function definition.
he: אפשר להשתמש רק פעם אחת בהגדרת פונקציה.

source: You have used it twice, with `*{first}` and `*{second}`.
he: השתמשת בו פעמיים, עם '*{first}' ו- '*{second}'.

source: It must either be used by itself, `*`, or in the form `*{args}`, but not both.
he: יש להשתמש בו בעצמו, "*", או בצורה '*{args}', אך לא שניהם.

source: `*{args}` must appear before `**{kwargs}`.
he: `*{args}` חייב להופיע לפני `** {kwargs}`.

source: `**{kwargs}` must appear after the `*` operator.
he: "** {kwargs}" חייב להופיע אחרי אופרטור "*".

source: You cannot use numbers as function arguments.
he: אי אפשר להשתמש במספרים כארגומנטים של פונקציות.

source: You used a number as an argument when defining a function. You can only use identifiers (variable names) as function arguments.
he: השתמשת במספר כארגומנט בעת הגדרת פונקציה. אפשר להשתמש רק במזהים (שמות משתנים) כארגומנטים של פונקציות.

source: You cannot use strings as function arguments.
he: אינך יכול להשתמש במחרוזות כארגומנטים של פונקציות.

source: You used a string as an argument when defining a function. You can only use identifiers (variable names) as function arguments.
he: השתמשת במחרוזת כארגומנט בעת הגדרת פונקציה. אפשר להשתמש רק במזהים (שמות משתנים) כארגומנטים של פונקציות.

source: You can only use identifiers (variable names) as function arguments. Assign any tuple to a parameter and unpack it within the body of the function.
he: אפשר להשתמש רק במזהים (שמות משתנים) כארגומנטים של פונקציות. צריך להקצות כל צמד לפרמטר ולפרק אותו בתוך גוף הפונקציה.

source: You cannot have explicit lists as function arguments.
he: אינך יכול\ה להכיל רשימות מפורשות כארגומנטים של פונקציות.

source: You can only use identifiers (variable names) as function arguments.
he: אפשר להשתמש רק במזהים (שמות משתנים) כארגומנטים של פונקציות.

source: You cannot have any explicit dict or set as function arguments.
he: אינך יכול\ה לקבל שום מילון (dict) מפורש או סט (set) כטיעוני פונקציה.

source: You cannot have operators as function arguments.
he: לא יכולים להיות לך אופרטורים כארגומנטים של פונקציות.

source: I suspect you made a typo and wrote `{op}` instead of a comma. The following statement contains no syntax error: {new_statement}
he: אני חושד שעשית שגיאת כתיב וכתבת '{op}' במקום פסיק. המשפט הבא אינו מכיל שגיאת תחביר: {new_statement}

source: Did you mean to write an equal sign?
he: האם התכוונת לכתוב סימן שווה?

source: I suspect you made a typo and wrote `{op}` instead of an equal sign. The following statement contains no syntax error: {new_statement}
he: אני חושד שעשית שגיאת כתיב וכתבת '{op}' במקום סימן שוויון. המשפט הבא אינו מכיל שגיאת תחביר: {new_statement}

source: Did you mean to write `{op}`?
he: האם התכוונת לכתוב '{op}'?

source: I suspect you made a typo and added `{op}` by mistake. The following statement contains no syntax error: {new_statement}
he: אני חושד שעשית שגיאת כתיב והוספת '{op}' בטעות. המשפט הבא אינו מכיל שגיאת תחביר: {new_statement}

source: You cannot use `{op}` as an argument.
he: אינך יכול להשתמש ב- '{op}' כטיעון.

source: I suspect you made a typo and wrote `{op}` by mistake. If you replace it by a unique variable name, the result will contain no syntax error.
he: אני חושד שעשית שגיאת כתיב וכתבת בטעות '{op}'. אם תחליף אותו בשם משתנה ייחודי, התוצאה לא יכיל שגיאת תחביר.

source: The `**` operator needs to be followed by an identifier (variable name).
he: אחרי האופרטור '**' צריך להיות מזהה (שם משתנה).

source: Positional arguments must come before keyword arguments.
he: ארגומנטים עמדתיים חייבים לבוא לפני ארגומנטים של מילות מפתח.

source: `{arg}` is a positional argument that appears after one or more keyword arguments in your function definition.
he: '{arg}' הוא ארגומנט עמדתי שמופיע לאחר אחד או יותר ארגומנטים של מילות מפתח בהגדרת הפונקציה שלך.

source: The line identified above is more indented than expected.
he: הקו המזוהה למעלה מכניס (יותר רווחים ) יותר מהצפוי.

source: The line identified above was expected to begin a new indented block.
he: הקו המזוהה למעלה היה צפוי להתחיל בלוק חדש בכניסה.

source: The line identified above is less indented than expected.
he: הקו המזוהה לעיל הוא עם פחות רווחים מהצפוי.

source: However, line {number}, which is identified as having a problem, consists of a single string which is also the case for the preceding line. Perhaps you meant to include a continuation character, `\`, at the end of line {preceding}.
he: עם זאת, שורה {number}, המזוהה כבעיה, מורכב ממחרוזת אחת, וזה גם המקרה עבור השורה הקודמת. אולי התכוונת לכלול דמות המשך, '\', בסוף השורה {preceding}.

source: You cannot assign a value to `{keyword}`.
he: אינך יכול להקצות ערך ל- '{keyword}'.

source: You cannot assign a value to the ellipsis symbol [`...`].
he: לא ניתן להקצות ערך לסמל האליפסיס (ellipsis) ['...'].

source: The ellipsis symbol `...` is a constant in Python;you cannot assign it a different value.
he: סמל האליפסיס (ellipsis ) '...' הוא קבוע בפייתון; אינך יכול\ה להקצות לו ערך אחר.

source: `{keyword}` is a constant in Python; you cannot assign it a different value.
he: `{keyword}` הוא קבוע בפיתון; אינך יכול להקצות לו ערך אחר.

source: You were trying to assign a value to the Python keyword `{keyword}`. This is not allowed.
he: ניסית להקצות ערך למילת המפתח של פייתון "{keyword}". זה אסור.

source: You can only assign objects to identifiers (variable names).
he: ניתן להקצות אובייקטים רק למזהים (שמות משתנים).

source: On the left-hand side of an equal sign, you have a conditional expression instead of the name of a variable. A conditional expression has the following form: variable = object if condition else other_object
he: בצד שמאל של סימן שוויון, יש לך ביטוי מותנה במקום שם של משתנה. לביטוי מותנה יש את הצורה הבאה: variable = object if condition else other_object (משתנה = אובייקט אם תנאי אחרת אובייקט אחר)

source: some value
he: ערך כלשהו

source: You wrote an expression like {fn_call} = {value} where `{fn_call}`, on the left-hand side of the equal sign, is a function call and not the name of a variable.
he: כתבת ביטוי כמו {fn_call} = {value} כאשר '{fn_call}', בצד שמאל של סימן השוויון זה קריאת פונקציה ולא שם המשתנה.

source: On the left-hand side of an equal sign, you have a generator expression instead of the name of a variable.
he: בצד שמאל של סימן שוויון, יש לך ביטוי גנרטור במקום שם של משתנה.

source: You wrote an expression that has the f-string `{fstring}` on the left-hand side of the equal sign. An f-string should only appear on the right-hand side of an equal sign.
he: כתבת ביטוי המכיל את מחרוזת f '{fstring}' בצד שמאל של סימן השוויון. מחרוזת f צריכה להופיע רק בצד ימין של סימן שווה.

source: of type `int`
he: מסוג int (שלם)

source: of type `complex`
he: מסוג complex (מורכב)

source: of type `float`
he: מסוג float (צף)

source: of type `str`
he: מסוג str (מחרוזת)

source: of type `dict`
he: מסוג dict (מילון)

source: of type `list`
he: מסוג list (רשימה)

source: of type `set`
he: מסוג set (סט)

source: of type `tuple`
he: מסוג tuple (צמד)

source: The object named `{name}` is defined with type annotation as a local variable. It cannot be declared to be a global variable.
he: האובייקט בשם '{name}' מוגדר עם ביאור סוג כמשתנה מקומי. לא ניתן להכריז עליו כמשתנה עולמי.

source: A for loop must have the form: for ... in sequence: where `...` must contain only identifiers (variable names) and not literals like `{bad_token}`.
he: לולאת פור (for) חייבת להיות בתבנית: עבור XXX ברצף: כאשר 'XXX' חייב להכיל רק מזהים (שמות משתנים) ולא מילוליות כמו '{bad_token}'.

source: variable_name
he: שם_משתנה

source: Perhaps you meant to write: {name} = {literal}
he: אולי התכוונת לכתוב: {name} = {literal}

source: Perhaps you meant to write `{name} = {literal}`
he: אולי התכוונת לכתוב '{name} = {letteral}'

source: You wrote an expression like {literal} = {name} where `{literal}`, on the left-hand side of the equal sign, is or includes an actual object {of_type} and is not simply the name of a variable.
he: כתבת ביטוי כמו {literal} = {name} כאשר '{literal}', בצד שמאל של סימן השווה, הוא או כולל אובייקט בפועל {of_type} וזה לא רק שמו של משתנה.

source: You wrote an expression that includes some mathematical operations on the left-hand side of the equal sign which should be only used to assign a value to a variable.
he: כתבת ביטוי הכולל כמה פעולות מתמטיות בצד שמאל של סימן השוויון שאמור להיות משמש רק להקצאת ערך למשתנה.

source: Perhaps you meant to write `{name}` instead of `{original}`
he: אולי התכוונת לכתוב '{name}' במקום '{original}'

source: Perhaps you needed `==` instead of `=`.
he: אולי היית צריך\ה '==' במקום '='.

source: You cannot use the augmented assignment operator `:=`, sometimes called the walrus operator, with literals like `{bad_token}`. You can only assign objects to identifiers (variable names).
he: אינך יכול להשתמש באופרטור ההקצאה המוגבר `: =`, לפעמים נקרא מפעיל הזן, עם מילת מילים כמו "{bad_token}". ניתן להקצות אובייקטים רק למזהים (שמות משתנים).

source: You declared `{name}` as being both a global and nonlocal variable. A variable can be global, or nonlocal, but not both at the same time.
he: הצהרת על '{שם}' כמשתנה גלובלי וגם לא מיקומי (global & nonlocal). משתנה יכול להיות גלובלי או לא מקומי, אך לא שניהם בו זמנית.

source: The Python keyword `break` can only be used inside a `for` loop or inside a `while` loop.
he: ניתן להשתמש במילת המפתח Python 'break' רק בתוך לולאת 'for' (פור) או בתוך לולאה של 'while' (בעוד).

source: The Python keyword `continue` can only be used inside a `for` loop or inside a `while` loop.
he: ניתן להשתמש במילת המפתח של פייתון 'המשך' רק בתוך לולאת 'for'(פור) או בתוך לולאה של 'while' (בעוד).

source: You attempted to delete a function call {line} instead of deleting the function's name {correct}
he: ניסית למחוק שיחת פונקציה {line} במקום למחוק את שם הפונקציה {correct}

source: You cannot delete the constant `{constant}`.
he: אינך יכול למחוק את הקבוע (constant ) '{constant}'.

source: Did you forget a closing quote?
he: שכחת גרשיים לסיום?

source: You started writing a string with a single or double quote but never ended the string with another quote on that line.
he: התחלת לכתוב מחרוזת עם גרש או מרכאות אך מעולם לא סיימת את המחרוזת בציטוט\מרכאות נוסף בשורה זו.

source: Perhaps you meant to write the backslash character, `\` as the last character in the string and forgot that you needed to escape it by writing two `\` in a row.
he: אולי התכוונת לכתוב את הלוכסן , '\' באות האחרונה במחרוזת ושכחת שאתה צריך לתקן זאת על ידי כתיבת שני '\' ברציפות.

source: Did you forget to escape a backslash character?
he: שכחת לשים לוחסן "\"?

source: One of the following two possibilities could be the cause: 1. You meant to do a comparison with == and wrote = instead. 2. You called a function with a named argument: a_function(invalid=...) where `invalid` is not a valid identifier (variable name) in Python either because it starts with a number, or is a string, or contains a period, etc.
he: אחת משתי האפשרויות הבאות יכולה להיות הסיבה: 1. התכוונת לעשות השוואה עם == וכתבת = במקום זאת. 2. קראת לפונקציה עם ארגומנט בשם: a_function (לא_חוקי = ...) כאשר 'invalid' אינו מזהה תקף (שם משתנה) ב- Python או בגלל שהוא מתחיל במספר, או שהוא מחרוזת, או מכיל נקודה וכו '.

source: You are using a generator expression, something of the form x for x in thing You must add parentheses enclosing that expression.
he: אתה משתמש בביטוי מחולל, משהו מהצורה x עבור x בדבר עליך להוסיף סוגריים המקיפים את הביטוי הזה.

source: You have called a function repeating the same keyword argument (`{arg}`). Each keyword argument should appear only once in a function call.
he: קראת לפונקציה שחוזרת על אותו ארגומנט של מילת מפתח ('{arg}'). כל ארגומנט של מילת מפתח צריך להופיע רק פעם אחת בשיחת פונקציה.

source: You likely called a function with a named argument: a_function(invalid=something) where `invalid` is not a valid variable name in Python either because it starts with a number, or is a string, or contains a period, etc.
he: סביר להניח שקראת לפונקציה עם ארגומנט בשם: a_function (לא חוקי = משהו) כאשר 'invalid' אינו שם משתנה חוקי ב- Python או בגלל שהוא מתחיל במספר, או שהוא מחרוזת, או מכיל נקודה וכו '.

source: Did you use copy-paste?
he: האם השתמשת בהעתק-הדבק?

source: Python indicates that you used the unicode character `{bad_character}` which is not allowed.
he: Python מציין שהשתמשת בתו unicode '{bad_character}' מה שאסור.

source: Did you mean to use a normal quote character, `'` or `"`?
he: האם התכוונת להשתמש בגרש או גרשיים נורמליים, '' או '' ''?

source: I suspect that you used a fancy unicode quotation mark instead of a normal single or double quote for a string.
he: אני חושד שהשתמשת בסימן מרכאות מפואר של יוניקוד במקום גרש או גרשיים למחרוזת.

source: Python tells us that the closing `{closing}` on the last line shown does not match the opening `{opening}` on line {lineno}.
he: פייתון מספר לנו שהסגירה '{closing}' בשורה האחרונה המוצגת אינו תואם את הפתיחה `{opening}` בשורה {lino}.

source: Python tells us that the closing `{closing}` on the last line shown does not match the opening `{opening}`.
he: פייתון מספר לנו כי הסגירה '{סגירה}' בשורה האחרונה המוצגת אינו תואם את הפתיחה `{opening}`.

source: Perhaps you forgot a closing quote.
he: אולי שכחת גרשי או גרשיים לסיום.

source: Inside the f-string `{fstring}`, you have another string, which starts with either a single quote (') or double quote ("), without a matching closing one.
he: בתוך מחרוזת f {{fstring} `, יש לך מחרוזת נוספת, שמתחילה ב גרש (') או גרשיים ("), ללא סיום תואם.

source: You are including the statement {newline} indicating that `{name}` is a variable defined outside a function. You are also using the same `{name}` as an argument for that function, thus indicating that it should be variable known only inside that function, which is the contrary of what `global` implied.
he: אתה כולל את ההצהרה {שורה חדשה} המציין כי "{name}" הוא משתנה המוגדר מחוץ לפונקציה. אתה משתמש גם באותו '{name}' כארגומנט לפונקציה הזו ובכך מציין כי היא צריכה להיות משתנה הידוע רק בתוך הפונקציה, שהיא ההפך ממה שמשתמע מה"global ".

source: You assigned a value to the variable `{name}` before declaring it as a global variable.
he: הקצית ערך למשתנה '{name}' לפני הכרזתו כמשתנה גלובלי.

source: You used the variable `{name}` before declaring it as a global variable.
he: השתמשת במשתנה '{name}' לפני הכרזתו כמשתנה גלובלי.

source: Did you forget to add `nonlocal`?
he: שכחת להוסיף `nonlocal`?

source: You assigned a value to the variable `{name}` before declaring it as a nonlocal variable.
he: הקצית ערך למשתנה '{name}' לפני הכרזתו כמשתנה לא -מקומי (nonlocal).

source: You used `{name}` as a parameter for a function before declaring it also as a nonlocal variable: `{name}` cannot be both at the same time.
he: השתמשת ב- '{name}' כפרמטר לפונקציה לפני שמכריזים עליו גם כמשתנה לא -מקומי (nonlocal): '{name}' לא יכול להיות שניהם בו זמנית.

source: Did you forget to write `nonlocal` first?
he: האם שכחת לכתוב 'nonlocal' קודם?

source: You used the variable `{name}` before declaring it as a nonlocal variable.
he: השתמשת במשתנה '{name}' לפני הכרזתו כמשתנה לא -מקומי. (nonlocal )

source: You used the nonlocal keyword at a module level. The nonlocal keyword refers to a variable inside a function given a value outside that function.
he: השתמשת במילת המפתח הלא-מקומית (nonlocal) ברמת מודול. מילת המפתח הלא-מקומית (nonlocal) מתייחסת למשתנה בתוך פונקציה ונותנת ערך מחוץ לפונקציה זו.

source: You declared the variable `{name}` as being a nonlocal variable but it cannot be found.
he: הכרזת על המשתנה '{name}' כ- משתנה לא-מקומי (nonlocal) אך לא ניתן למצוא אותו.

source: I am guessing that you wanted to divide by the number {number} and wrote \ instead of /.
he: אני מניח שרצית לחלק במספר {number} וכתבת "\" במקום "/".

source: Did you mean to divide by {number}?
he: האם התכוונת לחלק ב {number}?

source: I am guessing that you forgot to enclose some content in a string.
he: אני מנחש ששכחת לסגור תוכן כלשהו במחרוזת.

source: Python tells us that it reached the end of the file and expected more content.
he: פייתון מספר לנו שהוא הגיע לסוף הקובץ וציפו לתוכן נוסף.

source: I will attempt to be give a bit more information.
he: אני אנסה לתת קצת יותר מידע.

source: The closing {bracket} on line {linenumber} does not match anything.
he: הסגירה {bracket} בשורה {linenumber} אינה תואמת דבר.

source: In Python, you can call functions with only positional arguments test(1, 2, 3) or only keyword arguments test(a=1, b=2, c=3) or a combination of the two test(1, 2, c=3) but with the keyword arguments appearing after all the positional ones. According to Python, you used positional arguments after keyword ones.
he: ב- Python, אתה יכול לקרוא פונקציות עם ארגומנטים מיקוםיים בלבד f(1, 2, 3) או רק ארגומנטים של מילות מפתח f(a = 1, b = 2, c = 3) או שילוב של השניים f(1, 2, c = 3) אבל עם טיעוני מילת המפתח שמופיעים אחרי כל אלה המיקומיים. על פי פייתון, השתמשת בטיעונים מיקומיים אחרי מילות מפתח.

source: In Python, you can define functions with only positional arguments def test(a, b, c): ... or only keyword arguments def test(a=1, b=2, c=3): ... or a combination of the two def test(a, b, c=3): ... but with the keyword arguments appearing after all the positional ones. According to Python, you used positional arguments after keyword ones.
he: ב- Python, אתה יכול להגדיר פונקציות עם ארגומנטים מיקומיים בלבד def f(a, b, c) או רק ארגומנטים של מילות מפתח def f(a = 1, b = 2, c = 3) או שילוב של השניים def f(1, 2, c = 3) אבל עם טיעוני מילת המפתח שמופיעים אחרי כל אלה המיקומיים. על פי פייתון, השתמשת בטיעונים מיקומיים אחרי מילות מפתח.

source: Perhaps you need to type print({message}) In older version of Python, `print` was a keyword. Now, `print` is a function; you need to use parentheses to call it.
he: אולי אתה צריך להקליד print({message}) בגרסה ישנה יותר של פייתון, 'print' הייתה מילת מפתח. כעת, 'print' היא פונקציה; אתה צריך להשתמש בסוגריים כדי לקרוא לזה.

source: Did you mean `print({message})`?
he: האם התכוונת print({message}) '?

source: The star operator `*` is interpreted to mean that iterable unpacking is to be used to assign a name to each item of an iterable, which does not make sense here.
he: אופרטור הכוכב "*" מתפרש כמשמעותו יש להשתמש בפירוק חוזר כדי להקצות שם לכל פריט של חוזר, וזה לא הגיוני כאן.

source: You can only use a `return` statement inside a function or method.
he: אתה יכול להשתמש רק בהצהרת return(החזר) בתוך פונקציה או שיטה.

source: Seriously?
he: ברצינות?

source: You cannot be serious! In case this is a mistake in a real program, please consider reducing the number of nested code blocks.
he: אתה לא רציני! במקרה שזו טעות בתוכנית אמיתית, בבקשה שקול להפחית את מספר בלוקי הקוד .

source: Did you forget something after `*`?
he: שכחת משהו אחרי '*'?

source: Assuming you were defining a function, you need to replace `*` by either `*arguments` or by `*, named_argument=value`.
he: בהנחה שאתה מגדיר פונקציה, אתה צריך להחליף את "*" ב"*args "או על ידי `*, named_argument = value`.

source: This is a message that was added in Python 3.9 to prevent redefining `__peg_parser__`. It should not be present in other versions.
he: זו הודעה שנוספה בפייתון 3.9 כדי למנוע הגדרה מחדש של '__peg_parser__'. זה לא צריך להיות קיים בגרסאות אחרות.

source: The available features are `{names}`.
he: התכונות הזמינות הן '{names}'.

source: Instead of `{feature}`, perhaps you meant to import `{name}`.
he: במקום '{feature}', אולי התכוונת לייבא '{name}'.

source: `{feature}` is not a valid feature of module `__future__`.
he: `{feature}` אינה תכונה תקפה של המודול ` __future__`.

source: You started writing a triple-quoted string but never wrote the triple quotes needed to end the string.
he: התחלת לכתוב מחרוזת עם שלושה גרשיים אך מעולם לא כתבת את את שלושת הגרשיים המסיימים הדרושים כדי לסיים את המחרוזת.

source: Did you mean `{num}`?
he: האם התכוונת ל '{num}'?

source: Perhaps you meant to write the octal number `{num}` and forgot the letter 'o', or perhaps you meant to write a decimal integer and did not know that it could not start with zeros.
he: אולי התכוונת לכתוב את המספר האוקטלי '{num}' ושכחת את האות 'או', או שאולי התכוונת לכתוב מספר שלם עשרוני ולא ידעת שהוא לא יכול להתחיל באפס.

source: Perhaps you meant to write the integer `{num}` and did not know that it could not start with zeros.
he: אולי התכוונת לכתוב את המספר השלם '{num}' ולא ידעת שזה לא יכול להתחיל באפס.

source: I am guessing that you were writing a comprehension or a generator expression and forgot to include parentheses around tuples. As an example, instead of writing [i, i**2 for i in range(10)] you would need to write [(i, i**2) for i in range(10)]
he: אני מנחש שכתבת הבנה או ביטוי מחולל ושכח לכלול סוגריים סביב צמדים. כדוגמה, במקום לכתוב [i, i**2 for i in range(10)] תצטרך לכתוב [(i, i**2) for i in range(10)]

source: I am guessing that you wanted to use an `except` statement with multiple exception types. If that is the case, you must surround them with parentheses.
he: אני מניח שרצית להשתמש באמירה של 'except' (תפוס) עם מספר סוגי חריגים. אם זה המצב, אתה חייב להקיף אותם בסוגריים.

source: Did you forget a colon?
he: שכחת נקודתיים?

source: Python expected a colon at the position indicated.
he: פייתון ציפה לנקודתיים במיקום שצוין.
