Repository: matan-h/friendly
Catalog: friendly/locales/*/LC_MESSAGES/friendly.po
Languages: he

source: Python tells us that the {bracket} was never closed.
he: פייתון מספר לנו שה {bracket} מעולם לא נסגר.

source: The {bracket} was never closed.
he: ה- {bracket} מעולם לא נסגר.

source: The closing {bracket} on line {close_lineno} does not match the opening {open_bracket} on line {open_lineno}.
he: סגירת {bracket} בשורה {close_lineno} אינה תואמת את {open_bracket} הפתיחה בשורה {open_lineno}.

source: It looks like you copy-pasted code from an interactive interpreter. The Python prompt, `>>>`, should not be included in your code.
he: נראה שאתה מעתיק קוד שהודבק ממתורגמן אינטראקטיבי. שורת הפייתון, '>>> `, לא צריכה להיכלל בקוד שלך.

source: It looks like you copy-pasted code from an interactive interpreter. The Python prompt, `...`, should not be included in your code.
he: נראה שאתה מעתיק קוד שהודבק ממתורגמן אינטראקטיבי. שורת הפייתון, '...', לא צריכה להיכלל בקוד שלך.

source: You should not use the backquote character.
he: אתה לא אמור להשתמש בתו סימן ההטעמה המשני (grave accent).

source: You forgot to add a condition.
he: שכחת להוסיף תנאי.

source: An `if` statement requires a condition: if condition: ...
he: הצהרת 'if'(אם) דורשת תנאי: if (אם) מצב: ...

source: A `while` loop requires a condition: while condition: ...
he: לולאת 'while (בעוד)' דורשת תנאי: while (בעוד) מצב: ...

source: A `for` loop requires at least 3 more terms.
he: לולאת `for`(פור) דורשת לפחות 3 מונחים נוספים.

source: A class needs a name.
he: כיתה(class) צריכה שם.

source: You cannot use the Python keyword `{word}` as an attribute.
he: אינך יכול להשתמש במילת המפתח של פייתון '{word}' כתכונה.

source: `{word}` cannot be used as an attribute.
he: לא ניתן להשתמש ב- '{word}' כתכונה.

source: Perhaps you meant to write `elif`.
he: אולי התכוונת לכתוב elseif.

source: You likely meant to use Python's `elif` keyword but wrote `{name}` instead.
he: סביר שהתכוונת להשתמש במילת המפתח 'elif' של פייתון אבל כתוב '{name}' במקום זאת.

source: Did you mean `from {module} import {function}`?
he: האם התכוונת לfrom {module} import {function} ( 'מ- {module} יבוא {function} `) ?

source: You wrote something like import {function} from {module} instead of from {module} import {function}
he: כתבת משהו כמו ייבא import {function} from {module} ({function} מ- {module} ) במקום מתוך from {module} import {function} ({module} יבוא {function})

source: Perhaps you misplaced a quote.
he: אולי שמת במקום הלא נכון גרש.

source: There appears to be a Python identifier (variable name) immediately following a string. I suspect that you were trying to use a quote inside a string that was enclosed in quotes of the same kind.
he: נראה שיש מזהה פייתון (שם משתנה) מיד אחרי מחרוזת. אני חושד שניסית להשתמש בציטוט בתוך מחרוזת שהיה מוקף במרכאות מאותו סוג.

source: The augmented assignment operator is not allowed in Python version {version}.
he: מפעיל המקוצר אינו מותר בגרסת Python {version}.

source: You appear to be using the operator `:=`, sometimes called the walrus operator. This operator requires the use of Python 3.8 or newer. You are using version {version}.
he: נראה שאתה משתמש באופרטור `: =`, לפעמים נקרא "the walrus operator". מפעיל זה דורש שימוש ב- Python 3.8 ואילך. את\ה משתמש בגרסה {version}.

source: Did you write operators in an incorrect order?
he: כתבת אופרטורים בסדר לא נכון?

source: It looks like you wrote two operators (`{first}` and `{second}`) in the wrong order: `{wrong}` instead of `{correct}`.
he: נראה שכתבת שני אופרטורים ('{first}' ו- '{second}') בסדר הלא נכון: '{wrong}' במקום '{correct}'.

source: You wrote three equal signs in a row which is allowed in some programming languages, but not in Python. To check if two objects are equal, use two equal signs, `==`; to see if two names represent the exact same object, use the operator `is`.
he: כתבת שלושה סימנים שווים ברצף. זה דבר שמותר בחלק משפות תכנות, אך לא ב- פייתון. כדי לבדוק אם שני אובייקטים שווים, השתמש בשני סימני שוויון, `==`; כדי לראות אם שני שמות מייצגים אותו אובייקט בדיוק, השתמש באופרטור `is`.

source: Did you mean to use `is` instead of `===`?
he: האם התכוונת להשתמש ב- 'is' (הוא) במקום '==='?

source: You cannot have write the same operator, `{op}`, twice in a row. Perhaps you wrote one of them by mistake or forgot to write something between them.
he: אי אפשר לכתוב את אותו אופרטור, '{op}', פעמיים ברציפות. אולי כתבת אחד מהם בטעות או ששכחת לכתוב משהו ביניהם.

source: You cannot have these two operators, `{first}` and `{second}`, following each other. Perhaps you wrote one of them by mistake or forgot to write something between them.
he: אי אפשר לכתוב שני אופרטורים אלה, "{first}" ו- "{second}", עוקבים אחד אחרי השני. אולי כתבת אחד מהם בטעות או ששכחת לכתוב משהו ביניהם.

source: Or perhaps you included a space by mistake between the two operators and meant to write `{oper}` as a single operator.
he: או שאולי כללת רווח בטעות בין שני המפעילים ונועד לכתוב '{oper}' כמפעיל יחיד.

source: Did you mean to use `=`?
he: האם התכוונת להשתמש ב- '= `?

source: You use the augmented assignment operator `:=` where the normal assignment operator `=` was required.
he: אתה משתמש באופרטור מקוצר `: =` מתי שמפעיל ההקצאה הרגיל `=` נדרש.

source: You likely used an assignment operator `=` instead of an equality operator `==`.
he: סביר להניח שהשתמשת באופרטור הגדרה `=` במקום מפעיל שוויון `==`.

source: Perhaps you needed `==` or `:=` instead of `=`.
he: אולי היית צריך '==' או ': =' במקום '='.

source: You used an assignment operator `=`; perhaps you meant to use an equality operator, `==`, or the walrus operator `:=`.
he: השתמשת באופרטור מקוצר `=`; אולי התכוונת להשתמש במפעיל שוויון, `==`, או במפעיל ישיר `: =`.

source: In older version of Python, `print` was a keyword. Now, `print` is a function; you need to use parentheses to call it.
he: בגרסה ישנה יותר של פייתון, 'print' הייתה מילת מפתח. כעת, 'print' היא פונקציה; אתה צריך להשתמש בסוגריים כדי לקרוא לזה.

source: Did you mean `{new_line}`?
he: האם התכוונת ל '{new_line}'?

source: It looks as if you are attempting to use pip to install a module. `pip` is a command that needs to run in a terminal, not from a Python interpreter.
he: נראה כאילו אתה מנסה להשתמש ב- pip להתקנת מודול. `pip` היא פקודה שצריכה לפעול במסוף, לא מהמתורגמן של פייתון.

source: Pip cannot be used in a Python interpreter.
he: לא ניתן להשתמש ב- Pip במתורגמן של פייתון.

source: I am guessing that you are attempting to use Python to run a program. You must do so from a terminal and not from a Python interpreter.
he: אני מנחש שאתה מנסה להשתמש ב- Python להפעלת תוכנית. עליך לעשות זאת ממסוף ולא של מתורגמן פייתון.

source: You cannot have a dot `.` followed by `{bracket}`.
he: לא יכולה להיות לך נקודה `.` ואחריה "{bracket}".

source: Perhaps you need to replace the dot by a comma.
he: אולי אתה צריך להחליף את הנקודה בפסיק.

source: It looks like you are trying to raise an exception using Python 2 syntax.
he: נראה שאת\ה מנסה להעלות חריג באמצעות תחביר python 2.

source: Did you forget a colon `:`?
he: שכחת נקודתיים ':' ?

source: You wrote a `{for_while}` loop but forgot to add a colon `:` at the end
he: כתבת לולאה של {{for_while} `אבל שכחת להוסיף נקודתיים `:` בסוף

source: You wrote a statement beginning with `{name}` but forgot to add a colon `:` at the end.
he: כתבת הצהרה שמתחילה ב `{name}` אבל שכחת להוסיף נקודתיים `:` בסוף.

source: You wrote a semi-colon, `;`, where a comma was expected.
he: כתבת נקודה-פסיק, ';', איפה שהיה צפוי פסיק.

source: You wrote semi-colons, `;`, where commas were expected.
he: כתבת נקודה-פסיק, ';', איפה שהיה צפוי פסיקים.

source: Did you mean to write commas?
he: האם התכוונת לכתוב פסיקים?

source: Did you made a mistake in writing an hexadecimal integer?
he: האם טעית בכתיבת מספר שלם הקסדצימלי?

source: Did you made a mistake in writing an octal integer?
he: האם טעית בכתיבת מספר שלם אוקטלי?

source: Valid names cannot begin with a number.
he: שמות חוקיים אינם יכולים להתחיל במספר.

source: Did you mean `{number}j`?
he: האם התכוונת ל '{number}j'?

source: Perhaps you forgot a multiplication operator, `{first} * {second}`.
he: [הערה: '{first} * {second}' יהיה תקף גם מאחר ש '{first}' הוא מספר מורכב.]

source: Your Python version does not support this f-string feature.
he: גרסת ה- Python שלך אינה תומכת בתכונה זו של מחרוזת f.

source: You are likely using a 'debug' syntax of f-strings introduced in Python version 3.8. You are using version {version}.
he: סביר להניח שאתה משתמש בתחביר 'איתור באגים' של f-strings שהוצג בגרסת Python 3.8. אתה משתמש בגרסה {version}.

source: You are likely trying to assign a value within an f-string. This is not allowed.
he: סביר להניח שאתה מנסה להקצות ערך בתוך מחרוזת f. זה אסור.

source: The content of your f-string is invalid. Please consult the documentation: https://docs.python.org/3/reference/lexical_analysis.html#f-strings
he: התוכן של מחרוזת f אינו חוקי. אנא עיין בתיעוד: https://docs.python.org/3/reference/lexical_analysis.html#f-strings

source: Python keywords cannot be used as identifiers (variable names).
he: לא ניתן להשתמש במילות מפתח של פייתון כמזהים (שמות משתנים).

source: `lambda` does not allow parentheses around its arguments. This was allowed in Python 2 but it not allowed in Python 3.
he: `lambda` אינו מאפשר סוגריים סביב טיעוניו. זה מותר ב- Python 2 אך זה לא מותר ב- Python 3.

source: If you remove `{type_decl}`, you will have a valid Python statement.
he: אם תסיר את '{type_decl}', תהיה לך הצהרת Python חוקית.

source: However, even if you remove `{type_decl}`, there would still be some some syntax errors.
he: עם זאת, גם אם תסיר את '{type_decl}', עדיין יהיו כמה טעויות תחביר.

source: You do not need to declare variables in Python.
he: אינך צריך להכריז על סוג משתנים בפייתון.

source: It looks like you were trying to declare that `{var}` was a variable using the word `{type_decl}`.
he: נראה שניסית להצהיר כי "{var}" היה משתנה באמצעות המילה '{type_decl}'.

source: I am guessing that you forgot a comma between two strings when defining a dict.
he: אני מנחש ששכחת פסיק בין שני מחרוזות בעת הגדרת מילון (dict).

source: Did you forget to write `in`?
he: שכחת לכתוב 'in'(בתוך)?

source: It looks as though you forgot to use the keyword `in` as part of a `for` statement. Perhaps you meant: {new_statement}
he: נראה ששכחת להשתמש במילת המפתח 'in' (בתוך) כחלק מהצהרת `for ' (פור). אולי התכוונת ל: {new_statement}

source: Did you forget to write parenthesis?
he: שכחת לכתוב סוגריים?

source: It looks as though you forgot to use to use parenthesis with `range`. Perhaps you meant: {new_statement}
he: נראה ששכחת להשתמש בסוגריים עם 'range'('טווח'). אולי התכוונת ל: {new_statement}

source: Perhaps you meant to write `{keyword}` and made a typo. The correct line might be `{line}`
he: אולי התכוונת לכתוב '{keyword}' וביצעת שגיאת כתיב. השורה הנכונה עשויה להיות '{line}'

source: I am guessing that you were writing a comprehension or a generator expression and use the wrong order for a condition. The correct order depends if there is an `else` clause or not. For example, the correct order for a list comprehensions with condition can be either [f(x) if condition else other for x in sequence] # 'if' before 'for' or, if there is no `else` [f(x) for x in sequence if condition] # 'if' after 'for'
he: אני מנחש שכתבת הבנה או ביטוי מחולל (comprehension or a generator expression) והשתמשת בסדר הלא נכון. הסדר הנכון תלוי אם יש סעיף אחר (else) או לא לדוגמא,לדוגמה, הסדר הנכון לגנרטור הוא [f(x) if condition else other for x in sequence] # 'if' before 'for' אם אין "אחר" ו- [f(x) for x in sequence if condition] # 'if' after 'for' אם יש אחר

source: You cannot have spaces in identifiers (variable names).
he: אינך יכול להכיל רווחים במזהים (שמות משתנים).

source: `bf` is an illegal string prefix.
he: 'bf' היא קידומת מחרוזת לא חוקית.

source: I am guessing that you wanted a binary f-string; this is not allowed.
he: אני מנחש שרצית מחרוזת f בינארית; זה אסור.

source: It is possible that you forgot a comma between items in a tuple, or between function arguments, before the position indicated by ^.
he: יתכן ששכחת פסיק בין פריטים בצמד, או בין ארגומנטים של פונקציות, לפני הנקודה שציינה ב^.

source: It is possible that you forgot a comma between items in a list before the position indicated by ^.
he: ייתכן ששכחת פסיק בין פריטים ברשימה לפני הנקודה שציינה ב^.

source: It is possible that you forgot a comma between items in a set or dict before the position indicated by ^.
he: יתכן ששכחת פסיק בין פריטים בסט (set) או במילון (dict) לפני הנקודה שציינה ב ^.

source: Python indicates that the error is caused by `{second}` written immediately after `{first}`.
he: פייתון מציין כי השגיאה נגרמת על ידי "{second}" שקרה מיד לאחר "{first}".

source: Perhaps you meant {line}
he: אולי התכוונת {line}

source: Did you forget something between `{first}` and `{second}`?
he: שכחת משהו בין '{first}' ל- '{second}'?

source: Perhaps you meant to insert an operator like `{operators}` between `{first}` and `{second}`. The following lines of code would not cause any `SyntaxError`:
he: אולי התכוונת להכניס אופרטור כמו '{operators}' בין `{first}` ו- `{second}`. שורות הקוד הבאות לא יגרמו לשום 'SyntaxError':

source: It is possible that you used an equal sign `=` instead of a colon `:` to assign values to keys in a dict before or at the position indicated by ^.
he: ייתכן שהשתמשת בסימן שווה `=` במקום נקודתיים `:` כדי להקצות ערכים למפתחות במילון (dict) לפני או במיקום המצוין ב^.

source: The Python keyword `and` can only be used for boolean expressions. Perhaps you meant to write `{new_statement}`
he: ניתן להשתמש במילת המפתח and (וגם) רק לביטויים בוליאניים. אולי התכוונת לכתוב `{new_statement}`

source: I am guessing that you wrote {bad_token} twice in a row by mistake. If that is the case, you need to remove the second one.
he: אני מנחש שכתבת {bad_token} פעמיים ברציפות בטעות. אם זה המצב, עליך להסיר את השני.

source: Did you write {bad_token} twice by mistake?
he: האם כתבת {bad_token} פעמיים בטעות?

source: I am guessing that you wrote {bad_token} by mistake. Removing it and writing `{line}` seems to fix the error.
he: אני מנחש שכתבת את {bad_token} בטעות. נראה כי הסרתו וכתיבת '{line}' פותרים את השגיאה.

source: Did you write {bad_token} by mistake?
he: האם כתבת את {bad_token} בטעות?

source: The opening {bracket} on line {linenumber} is not closed.
he: הפתיחה {bracket} בשורה {linenumber} אינה סגורה.

source: If this is incorrect, please report this case.
he: אם זה לא נכון, אנא דווח על מקרה זה.

source: parenthesis `(`
he: סוגריים `(`

source: parenthesis `)`
he: סוגריים `)`

source: square bracket `[`
he: סוגר מרובע `[`

source: square bracket `]`
he: סוגר מרובע `]`

source: curly bracket `{`
he: סוגר מתולתל `{`

source: curly bracket `}`
he: סוגר מתולתל `}`
